{"666":"2X","10588":"CPU","3807621":"Beyond fast.","24953306":"AMD Ryzen™ 8040","66656455":"Power your victories with the OMEN PSU, delivering reliable energy for peak performance. Silent and efficient, it ensures your system runs smoothly.","-2f83a27":"laptops","3d2273d7":"desktops","-139911a7":"monitors","-3ca85cd0":"accessories","71d58991":"OMEN 35L","6e73edcd":"Play with the best.","-3067ef7f":"Our first desktop built with OMEN components, the OMEN 35L is pre-tuned for all-out performance right out of the box. And with more ways to upgrade for the future, there’s no limit to how you can win.","1a08228c":"SHOP NOW","148b4a45":"Close Modal","-69016fb5":"It’s the inside that counts.","50dd8755":"From the most powerful Intel® and AMD processors all the way up to the NVIDIA® GeForce RTX™ 4090, the OMEN 35L is more than capable of playing at full speed. Plus with up to four fans available, you’ll also play it cool.","199d1902":"Up to AMD Ryzen™ 7 8700G with up to 16 AI TOPS","1148c":"GPU","-6ca7f99a":"Up to AMD Radeon™ RX 7600 or NVIDIA® GeForce RTX™ 4090","-78aa4eff":"MEMORY","7ad67047":"Up to Kingston FURY 64GB DDR5 6000 MT/s Memory","-458431a5":"STORAGE","4e68430a":"Up to Two 2TB SSD & ","32ad8703":"2TB HDD Storage","638d43d9":"COOLING","-7c5a764":"Up to OMEN 240mm LCD Liquid Cooler","26d801":"SIZE","4c95bafe":"8.27 x 16.06 ","66ee91e1":"x 16.14 in","638866b6":"Battle ready, right out of the box.","-1328106e":"From the power supply to the CPU cooler, the 35L is the first desktop built with OMEN components. That means everything is pre-tuned to perform at its peak from the moment you power on.","b8365cf":"omen components","-61f01867":"OMEN inside.","-560fdace":"Win today and conquer tomorrow with easily upgradable OMEN components including case fans, liquid cooling options and power supply.","46fbba9a":"Omen fan","-3991a734":"Keep your rig cool and your gameplay on fire with the OMEN Gaming Tower Fan. Silent, powerful airflow for uninterrupted domination.","-67cf36af":"WATCH ","-60864e85":"INSTALL","46fb6639":"Omen PSU","-419379f9":"OMEN CPU COOLER","-2254a447":"Keep your system chill and your performance sharp with the OMEN CPU Cooler. Silent and efficient, it ensures peak power for uninterrupted gaming domination.","-6c6d5e7f":"FULL SPECIFICATIONS","4f48ace8":"Play with AI performance.","-334e70ef":"Unlock new levels of play, performance and efficiency with the AMD Ryzen™ 8040. A dedicated NPU, GPU and CPU work together to perform up to 39 trillion operations per second, the most you can get on a consumer Windows x86 processor today.","7bd5c9b4":"Thermal control","-6b80f1b1":"Turn up the","-435bdd18":"cool factor.","4c9ba7a1":"Featuring a proprietary fan curve and customizable ARGB air cooler with options for 2 and 4 heat pipes, the OMEN 35L delivers a 10-14% thermal improvement plus superior noise and heat reduction in one package. For advanced cooling, the 240mm Liquid Cooler with LCD option ensures optimal temperature control and a visual flair to complement your setup.","-67f4f336":"140mm Front Fans","be62":"14%","61baf58d":"Thermal Improvement","7e40e446":"Case Dimensions (35mm x 68mm)","734dd97f":"244mm x 244mm mATX Motherboard","-73fb528":"Sustainable design with recycled materials","-7ce760ee":"Easily upgradeable with tool-free access","5527b460":"Advancing the future of ai in gaming.","-6325a06b":"Experience the future of gaming with AI-enhanced OMEN PCs. With features like  AMD Ryzen™ AI, a dedicated AI engine designed for the ultimate in AI processing efficiency; an AMD Radeon™ graphics engine optimized for AI workloads; and AMD Ryzen™ processor cores that also have powerful AI capabilities.","4c68883d":"omen gaming hub","498ea6cd":"Maximize your play","1f60d8f7":"Elevate your gaming every time you play. This all-in-one suite seamlessly combines performance optimization, personalization tools, plus game content and services to unlock an unparalleled gaming experience.","29f4e524":"EXPLORE THE","43321d64":"GAMING HUB","-3d19a0d0":"complete the package","40fcd7f7":"Desktops","26c14b10":"Accessories","27d351b9":"LAPTOPS","6bc863d7":"DESKTOPS","1b0cde59":"MONITORS","43ab3710":"ACCESSORIES","-43c1f451":"SUPPORT","6d49a658":"Sign up for our newsletter to receive a 20% discount*!","200d":"‍","74db315b":"Get a sneak peek at our new products when ","42c5dd59":"you sign up to join the HyperX Family.","-b480bd":"I am happy to receive emails from HyperX on its products and info. HyperX respects your privacy. Visit our ","-22f3f969":"Privacy Statement","-4880aac6":" to learn how HyperX collects and uses your personal data.","9bf3b6f":"* Terms & Conditions apply","5a0ea5a1":"Thank you! Your submission has been received!","-7c112e99":"Oops! Something went wrong while submitting the form.","-bee99e0":"monitors / omen 32"}